---
kind: property
id: P:Autodesk.Revit.UI.PreviewControl.ScrollbarVisibility
source: html/47564ce4-9122-2746-8d5e-559a283c2b67.htm
---
# Autodesk.Revit.UI.PreviewControl.ScrollbarVisibility Property

The visibility of the preview view scrollbars.

## Syntax (C#)
```csharp
public ScrollbarVisibility ScrollbarVisibility { get; set; }
```